#include "holidays.h"

PGM_STR_LIST_OBJ_STATIC(
    holidays_list,
    "Новый Год\nВсемирный дeнь пoxмeлья",                     // 01.01
    "Дeнь нaучнoй фaнтacтики",                                // 02.01
    "День женщин в рок-н-ролле",                              // 03.01
    "День Ньютона\nДень гипноза",                             // 04.01
    "Всемирный разгрузочный день",                            // 05.01
    "Рождественский сочельник",                               // 06.01
    "Рoждecтвo Хpиcтoвo\nДень распутывания лыжных следов",    // 07.01
    "День вращения Земли",                                    // 08.01
    "День путешествия на воздушном шаре",                     // 09.01
    "День санок\nДень рождения имбирного пряника",            // 10.01
    "День заповедников\nДень Спасибо",                        // 11.01
    "День работника прокуратуры\nДень северного сияния",      // 12.01
    "День российской печати",                                 // 13.01
    "Васильев день\nСтарый Новый Год",                        // 14.01
    "День шаурмы\nДень рождения Википедии",                   // 15.01
    "День горячей и острой пищи",                             // 16.01
    "День детских изoбpeтeний",                               // 17.01
    "Крещенский сочельник",                                   // 18.01
    "Крещение",                                               // 19.01
    "День любителей сыра",                                    // 20.01
    "День остроумных фраз\nДень объятий",                     // 21.01
    "День попкорна",                                          // 22.01
    "День Свекрови\nДень пирога",                             // 23.01
    "День рождения баночного пива\nДень эскимо",              // 24.01
    "Татьянин день\nДень студента",                           // 25.01
    "День случайных направлений\nДень таможенника",           // 26.01
    "День портвейна\nДень снятия блокады Ленинграда",         // 27.01
    "День без Интернета\nДень LEGO",                          // 28.01
    "День пузырчатой упаковки\nДень изoбpeтeния автомобиля",  // 29.01
    "День деда Мороза и Снегурочки",                          // 30.01
    "День рождения водки\nДень клейкой ленты",                // 31.01
    "День Робинзона Крузо\nДень без политики",                // 01.02
    "День ежа (сурка)\nДень буквы Ы",                         // 02.02
    "День нежности",                                          // 03.02
    "День онколога\nДень рождения калош",                     // 04.02
    "День Нутеллы",                                           // 05.02
    "День ступенек и лестниц\nДень бармена",                  // 06.02
    "День варенья\nДень числа e",                             // 07.02
    "День зимней рыбалки\nДень науки РФ",                     // 08.02
    "День стоматолога\nДень пиццы",                           // 09.02
    "День домового\nДень памяти А.С. Пушкина",                // 10.02
    "День больного\nДень довольных одиночеством",             // 11.02
    "День Дарвина\nДень репродуктивного здоровья",            // 12.02
    "День шаурмы 2\nДень подруг",                             // 13.02
    "День Святого Валентина\nДень компьютерщика",             // 14.02
    "День Галилео Галилея",                                   // 15.02
    "День валенка",                                           // 16.02
    "День катания на лыжах\nДень капусты",                    // 17.02
    "День пельменей\nДень батарейки",                         // 18.02
    "День орнитолога",                                        // 19.02
    "День алкоголика\nДень курильщика трубки",                // 20.02
    "День фельдшера\nДень женского счастья",                  // 21.02
    "День размышлений",                                       // 22.02
    "День защитника отечества",                               // 23.02
    "День полосок и пятнышек",                                // 24.02
    "День открытия спирта и револьвера",                      // 25.02
    "День термоса\nДень фисташек",                            // 26.02
    "День оптимиста\nДень покемона",                          // 27.02
    "День ухода зимы",                                        // 28.02
    "Високосный день",                                        // 29.02
    "День кошек\nПервый день весны",                          // 01.03
    "День спички и компакт-диска",                            // 02.03
    "День писателя",                                          // 03.03
    "День памяти Н.В. Гоголя\nДень мини-юбки",                // 04.03
    "День рождения степлера",                                 // 05.03
    "Всероссийский день гурмана",                             // 06.03
    "День тюльпанов",                                         // 07.03
    "Женский день",                                           // 08.03
    "День диджея\nДень Барби",                                // 09.03
    "День архивов\nДень крутизны",                            // 10.03
    "День водопровода",                                       // 11.03
    "День ананаса",                                           // 12.03
    "День заглядывания в замочные скважины",                  // 13.03
    "День числа Пи\nДень рождения бутерброда",                // 14.03
    "День защиты прав потребителей",                          // 15.03
    "День цветных карандашей",                                // 16.03
    "День Святого Патрика",                                   // 17.03
    "День выхода человека в открытый космос",                 // 18.03
    "День самогонщиков",                                      // 19.03
    "День счастья\nДень астрологии",                          // 20.03
    "День поэзии",                                            // 21.03
    "Тень таксиста\nДень воды",                               // 22.03
    "День метеоролога\nДень одинаковых носков",               // 23.03
    "День борьбы с туберкулезом",                             // 24.03
    "День работника культуры\nДень вафель",                   // 25.03
    "День одиночества",                                       // 26.03
    "День виски\nДень театра",                                // 27.03
    "День рождения стиральной машины",                        // 28.03
    "День русалки",                                           // 29.03
    "День защиты Земли",                                      // 30.03
    "День эйфелевой башни",                                   // 31.03
    "День смеха (День дурака)",                               // 01.04
    "День детской книги",                                     // 02.04
    "День рождения мобильного телефона",                      // 03.04
    "День интернета\nДень витамина c",                        // 04.04
    "День супа",                                              // 05.04
    "День разноцветных ленточек",                             // 06.04
    "День здоровья\nДень бобра",                              // 07.04
    "День цыган",                                             // 08.04
    "День рождения Будды",                                    // 09.04
    "День гречки",                                            // 10.04
    "День анимешника",                                        // 11.04
    "День космонавтики",                                      // 12.04
    "День рок-н-ролла",                                       // 13.04
    "День внезапного смеха",                                  // 14.04
    "День добрых дел",                                        // 15.04
    "День чарли чаплина",                                     // 16.04
    "День денег\nДень кофе",                                  // 17.04
    "День радиолюбителя",                                     // 18.04
    "День велосипеда",                                        // 19.04
    "День поиска смысла жизни",                               // 20.04
    "День пряника",                                           // 21.04
    "День Земли",                                             // 22.04
    "День ковыряния в носу",                                  // 23.04
    "День стоматолога",                                       // 24.04
    "День бумажных самолетиков",                              // 25.04
    "День варки картофеля",                                   // 26.04
    "День вахтовика",                                         // 27.04
    "День работников скорой",                                 // 28.04
    "День исполнения детских желаний",                        // 29.04
    "День пожарной охраны",                                   // 30.04
    "День труда",                                             // 01.05
    "День отдыха\nДень Гарри Поттера",                        // 02.05
    "День хватания за грудь\nДень Солнца",                    // 03.05
    "День собачьего счастья",                                 // 04.05
    "День принцесс",                                          // 05.05
    "День бекона",                                            // 06.05
    "День создания ВС РФ\nДень радио",                        // 07.05
    "День Coca-Cola",                                         // 08.05
    "День Победы",                                            // 09.05
    "День семейных трусов",                                   // 10.05
    "День ниндзя",                                            // 11.05
    "День медсестры",                                         // 12.05
    "День одуванчика",                                        // 13.05
    "День фрилансера",                                        // 14.05
    "День семьи\nДень метро",                                 // 15.05
    "День света",                                             // 16.05
    "День рождения WWW",                                      // 17.05
    "День майского жука\nДень музеев",                        // 18.05
    "День пионерии",                                          // 19.05
    "День рождения джинсов",                                  // 20.05
    "День чая",                                               // 21.05
    "День винигрета",                                         // 22.05
    "День черепахи",                                          // 23.05
    "День валяния в траве",                                   // 24.05
    "День сотворения мира",                                   // 25.05
    "День предпринимателя",                                   // 26.05
    "День библиотек",                                         // 27.05
    "День пограничника\nДень майонеза",                       // 28.05
    "День гадания на ромашках",                               // 29.05
    "День окрошки",                                           // 30.05
    "День блондинок",                                         // 31.05
    "День защиты детей",                                      // 01.06
    "День воздушных змеев",                                   // 02.06
    "День прогульщика",                                       // 03.06
    "День любителей лета",                                    // 04.06
    "День эколога",                                           // 05.06
    "День русского языка",                                    // 06.06
    "День солнечного зайчика",                                // 07.06
    "День социального работника",                             // 08.06
    "День друзей",                                            // 09.06
    "День мороженого",                                        // 10.06
    "День поиска новой звезды (день звездопадов)",            // 11.06
    "День России",                                            // 12.06
    "День хрена. Ну и хрен с ним!",                           // 13.06
    "Банный день",                                            // 14.06
    "День ветра",                                             // 15.06
    "День чекушки",                                           // 16.06
    "День крокодила",                                         // 17.06
    "День поиска четырёхлистного клевера",                    // 18.06
    "День прогулки",                                          // 19.06
    "День Wi-Fi",                                             // 20.06
    "День йоги",                                              // 21.06
    "День подмигивания кошкам",                               // 22.06
    "Олимпийский день",                                       // 23.06
    "День Святого Духа",                                      // 24.06
    "День улыбок незнакомым людям",                           // 25.06
    "День рождения зубной щетки",                             // 26.06
    "День молодежи",                                          // 27.06
    "День пирсинга",                                          // 28.06
    "День поиска кладов и секретов",                          // 29.06
    "День разбрасывания монет",                               // 30.06
    "День ветеранов боевых действий",                         // 01.07
    "День собак\nДень НЛО",                                   // 02.07
    "День ГИБДД МВД России",                                  // 03.07
    "День независимости США",                                 // 04.07
    "День трудоголиков",                                      // 05.07
    "День поцелуя",                                           // 06.07
    "Иван Купала",                                            // 07.07
    "День семьи, любви и верности",                           // 08.07
    "День сахарного печенья",                                 // 09.07
    "Полтавское сражение",                                    // 10.07
    "День шоколада",                                          // 11.07
    "День бортпроводника\nДень фотографа",                    // 12.07
    "День головоломки",                                       // 13.07
    "День рыбака\nДень почты",                                // 14.07
    "День навыков молодежи",                                  // 15.07
    "День вкусной еды",                                       // 16.07
    "День эмоджи",                                            // 17.07
    "День прогулок под дождем",                               // 18.07
    "День пирожков с малиновым вареньем",                     // 19.07
    "День шахмат\nДень Луны",                                 // 20.07
    "День нездоровой пищи\nДень металлурга",                  // 21.07
    "День мозга",                                             // 22.07
    "День китов и дельфинов\nДень дачника",                   // 23.07
    "День заботы о себе",                                     // 24.07
    "День вне времени",                                       // 25.07
    "День дяди и тети\nДень парашютиста",                     // 26.07
    "День рождения гамбургера",                               // 27.07
    "День Крещения Руси\nДень пиарщика",                      // 28.07
    "День тигра",                                             // 29.07
    "Международный день дружбы",                              // 30.07
    "День необычных музыкальных инструментов",                // 31.07
    "День инкассатора",                                       // 01.08
    "День ВДВ",                                               // 02.08
    "День арбуза",                                            // 03.08
    "День железнодорожника",                                  // 04.08
    "День светофора",                                         // 05.08
    "День борьбы за запрещение ядерного оружия",              // 06.08
    "День холостяка",                                         // 07.08
    "Всемирный день кошек",                                   // 08.08
    "День книголюбов",                                        // 09.08
    "День физкультурника",                                    // 10.08
    "День строителя",                                         // 11.08
    "Всемирный день молодежи",                                // 12.08
    "День левшей",                                            // 13.08
    "День рождения Telegram",                                 // 14.08
    "День археолога\nДень любви",                             // 15.08
    "День малинового варенья",                                // 16.08
    "День секонд-хенда\nДень бездомных животных",             // 17.08
    "День географа",                                          // 18.08
    "День фотографии",                                        // 19.08
    "День лени\nДень комара",                                 // 20.08
    "День офицера",                                           // 21.08
    "День Государственного флага РФ",                         // 22.08
    "День полёта божьих коровок",                             // 23.08
    "День странной музыки",                                   // 24.08
    "День шахтера",                                           // 25.08
    "День благодарности собаке",                              // 26.08
    "День бокса",                                             // 27.08
    "День мечты",                                             // 28.08
    "День гуляния по крышам",                                 // 29.08
    "День китовой акулы",                                     // 30.08
    "День блога",                                             // 31.08
    "День знаний\nДень любителей сериалов",                   // 01.09
    "День российской гвардии",                                // 02.09
    "День прощания",                                          // 03.09
    "День рождения игры \"Что? Где? Когда?\"",                // 04.09
    "День благотворительности",                               // 05.09
    "День рыжих",                                             // 06.09
    "День бороды",                                            // 07.09
    "День грамотности",                                       // 08.09
    "День красоты",                                           // 09.09
    "День занюхивателя",                                      // 10.09
    "День трезвости",                                         // 11.09
    "День вязания крючком\nДень программиста",                // 12.09
    "День парикмахера",                                       // 13.09
    "День оказания первой помощи",                            // 14.09
    "День свободных денег",                                   // 15.09
    "День охраны озонового слоя",                             // 16.09
    "День гнома",                                             // 17.09
    "День мониторинга воды",                                  // 18.09
    "День рождения Смайлика",                                 // 19.09
    "День риса",                                              // 20.09
    "День мира",                                              // 21.09
    "День без автомобиля",                                    // 22.09
    "День жестовых языков",                                   // 23.09
    "День караванщика",                                       // 24.09
    "День фармацевта",                                        // 25.09
    "День встречи со старыми друзьями",                       // 26.09
    "День туризма",                                           // 27.09
    "День работника атомной промышленности",                  // 28.09
    "День сердца",                                            // 29.09
    "День интернета (РФ)",                                    // 30.09
    "День музыки\nДень вегетарианства",                       // 01.10
    "День социального педагога",                              // 02.10
    "День трезвости и борьбы с алкоголизмом",                 // 03.10
    "День животных\nДень Космических войск",                  // 04.10
    "День учителя",                                           // 05.10
    "День страховщика",                                       // 06.10
    "День врача",                                             // 07.10
    "День осьминога",                                         // 08.10
    "День почты",                                             // 09.10
    "День психического здоровья\nДень зрения",                // 10.10
    "День яйца\nДень девочек",                                // 11.10
    "День кадрового работника",                               // 12.10
    "День инфобизнесмена",                                    // 13.10
    "День стандартизации",                                    // 14.10
    "День Белой трости\nДень мытья рук",                      // 15.10
    "День хлеба и продовольствия",                            // 16.10
    "День участкового терапевта",                             // 17.10
    "День галстука\nДень конфет",                             // 18.10
    "День лицеиста",                                          // 19.10
    "День отца\nДень авиадиспетчера",                         // 20.10
    "День цемента",                                           // 21.10
    "День заик",                                              // 22.10
    "День рекламщика",                                        // 23.10
    "День без бумаги",                                        // 24.10
    "День таможенника\nДень маркетолога",                     // 25.10
    "День приятных неожиданностей",                           // 26.10
    "День плюшевого мишки",                                   // 27.10
    "День анимации\nДень бабушек и дедушек в РФ",             // 28.10
    "День борьбы с инсультом",                                // 29.10
    "День инженера-механика\nДень тренера",                   // 30.10
    "День городов",                                           // 31.10
    "День гадания на кофейной гуще\nДень вегана",             // 01.11
    "День мужчин",                                            // 02.11
    "День оладушек",                                          // 03.11
    "День народного единства",                                // 04.11
    "День варенья",                                           // 05.11
    "День одиноких и независимых женщин",                     // 06.11
    "День холодца",                                           // 07.11
    "День без Wi-Fi\nДень пианиста",                          // 08.11
    "День лизинга",                                           // 09.11
    "День кухонной мойки",                                    // 10.11
    "День шопинга",                                           // 11.11
    "Синичкин день",                                          // 12.11
    "День доброты\nДень слепых",                              // 13.11
    "День качества\nдень логопеда",                           // 14.11
    "День вторичной переработки\nДень молочного коктейля",    // 15.11
    "День проектировщика",                                    // 16.11
    "Международный день студентов",                           // 17.11
    "День рождения Деда Мороза",                              // 18.11
    "Международный мужской день",                             // 19.11
    "День ребенка\nДень педиатра",                            // 20.11
    "День приветствий",                                       // 21.11
    "День сыновей\nДень психолога",                           // 22.11
    "День акварели",                                          // 23.11
    "День матери\nДень моржа",                                // 24.11
    "День гармониста\nДень домашней кухни",                   // 25.11
    "День информации\nДень сапожника",                        // 26.11
    "День самозанятых",                                       // 27.11
    "День сострадания",                                       // 28.11
    "День буквы Ё",                                           // 29.11
    "День домашних животных",                                 // 30.11
    "День хоккея",                                            // 01.12
    "День банковского работника",                             // 02.12
    "день инвалидов\nДень юриста",                            // 03.12
    "День заказа подарков и\nнаписания писем Деду Морозу",    // 04.12
    "День онлайн-предпринимателя",                            // 05.12
    "День рождения микроволновой печи",                       // 06.12
    "День гражданской авиации",                               // 07.12
    "День художника",                                         // 08.12
    "День борьбы с коррупцией",                               // 09.12
    "День прав человека",                                     // 10.12
    "Международный день гор",                                 // 11.12
    "День Конституции РФ",                                    // 12.12
    "День медведя",                                           // 13.12
    "Наумов день",                                            // 14.12
    "День чая",                                               // 15.12
    "День покорения вершин",                                  // 16.12
    "День курьера",                                           // 17.12
    "День мигранта",                                          // 18.12
    "День рождения Олимпийского Мишки",                       // 19.12
    "День ФСБ",                                               // 20.12
    "День баскетбола",                                        // 21.12
    "День энергетика",                                        // 22.12
    "День снежных ангелов",                                   // 23.12
    "День украшения елки",                                    // 24.12
    "Католическое Рождество",                                 // 25.12
    "День подарков",                                          // 26.12
    "День спасателя",                                         // 27.12
    "День кино",                                              // 28.12
    "День пушистой ёлки",                                     // 29.12
    "День страны, которой нет",                               // 30.12
    "Канун Нового Года"                                       // 31.12

);